#include <iostream>


using namespace std;



void main()
{
    setlocale(0, "");


    char cells[9] = { '-','-','-','-','-','-','-','-','-', };

    int cell;
    int cell1;

    cout << "------------" << "\n" << endl;
    cout << "Номера клеток:" << endl;
    cout << "-" << 1 << "-" << '|' << "-" << 2 << "-" << '|' << "-" << 3 << "-" << " |" << endl;
    cout << "-" << 4 << "-" << '|' << "-" << 5 << "-" << '|' << "-" << 6 << "-" << " |" << endl;
    cout << "-" << 7 << "-" << '|' << "-" << 8 << "-" << '|' << "-" << 9 << "-" << " |" << "\n" << endl;


    for (int o = 0; o <= 9; ++o) {
        cout << "Введите номер клетки, куда ходить  игроку 1: ";
        cin >> cell;
        cells[cell - 1] = 'x';

        cout << "-" << cells[0] << "-" << '|' << "-" << cells[1] << "-" << '|' << "-" << cells[2] << "-" << " |" << endl;
        cout << "-" << cells[3] << "-" << '|' << "-" << cells[4] << "-" << '|' << "-" << cells[5] << "-" << " |" << endl;
        cout << "-" << cells[6] << "-" << '|' << "-" << cells[7] << "-" << '|' << "-" << cells[8] << "-" << " |" << "\n" << endl;



        cout << "Введите номер клетки, куда ходить игроку 2: ";
        cin >> cell1;
        cells[cell1 - 1] = '0';

        cout << "-" << cells[0] << "-" << '|' << "-" << cells[1] << "-" << '|' << "-" << cells[2] << "-" << " |" << endl;
        cout << "-" << cells[3] << "-" << '|' << "-" << cells[4] << "-" << '|' << "-" << cells[5] << "-" << " |" << endl;
        cout << "-" << cells[6] << "-" << '|' << "-" << cells[7] << "-" << '|' << "-" << cells[8] << "-" << " |" << "\n" << endl;
    }
    system("pause");
}